reports/benchmark/hygon_bw1000/MiniMax-M2.5-bf16/test_06/01/64-300-i70000-o1500/bench-test_06-64-300-i70000-o1500.log
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7fb3b29ce050>, seed=123, num_prompts=300, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=70000, random_output_len=1500, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai-chat', base_url='http://127.0.0.1:8080', host='127.0.0.1', port=8000, endpoint='/v1/chat/completions', header=None, max_concurrency=64, model='/data/models/MiniMax-M2.5-bf16', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, trust_remote_code=True, disable_tqdm=False, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False, percentile_metrics=None, metric_percentiles='95,99', goodput=None, request_id_prefix='bench-0c06be7e-', top_p=None, top_k=None, min_p=None, temperature=0.7, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name='minimax-m2.5', lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=30, extra_body=None)
INFO 04-12 03:54:12 [datasets.py:612] Sampling input_len from [70000, 70000] and output_len from [1500, 1500]
Starting initial single prompt test run...
Waiting for endpoint to become up in 30 seconds

 |          | 00:00 elapsed, ? remaining
 |          | 00:00 elapsed, 00:00 remaining
 |          | 01:09 elapsed, 332:43:47 remaining
Initial test run completed.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 64

  0%|          | 0/300 [00:00<?, ?it/s]
  0%|          | 1/300 [03:40<18:17:00, 220.14s/it]
  1%|          | 2/300 [04:41<10:29:11, 126.68s/it]
  1%|          | 3/300 [05:42<7:58:34, 96.68s/it]  
  1%|▏         | 4/300 [07:54<9:06:27, 110.77s/it]
  2%|▏         | 5/300 [08:46<7:19:10, 89.32s/it] 
  2%|▏         | 6/300 [09:47<6:30:38, 79.72s/it]
  2%|▏         | 7/300 [11:58<7:51:46, 96.61s/it]
  3%|▎         | 8/300 [12:59<6:55:12, 85.32s/it]
  3%|▎         | 9/300 [14:00<6:17:27, 77.83s/it]
  3%|▎         | 10/300 [16:14<7:39:03, 94.98s/it]
  4%|▎         | 11/300 [17:15<6:47:56, 84.69s/it]
  4%|▍         | 12/300 [18:16<6:11:59, 77.50s/it]
  4%|▍         | 13/300 [20:31<7:33:09, 94.74s/it]
  5%|▍         | 14/300 [21:22<6:29:19, 81.68s/it]
  5%|▌         | 15/300 [22:23<5:58:33, 75.49s/it]
  5%|▌         | 16/300 [24:37<7:19:48, 92.92s/it]
  6%|▌         | 17/300 [25:38<6:33:21, 83.40s/it]
  6%|▌         | 18/300 [26:39<6:00:39, 76.74s/it]
  6%|▋         | 19/300 [28:53<7:19:59, 93.95s/it]
  7%|▋         | 20/300 [29:55<6:32:50, 84.18s/it]
  7%|▋         | 21/300 [30:56<5:59:13, 77.25s/it]
  7%|▋         | 22/300 [33:08<7:13:40, 93.60s/it]
  8%|▊         | 23/300 [33:59<6:13:41, 80.94s/it]
  8%|▊         | 24/300 [35:00<5:45:05, 75.02s/it]
  8%|▊         | 25/300 [37:14<7:04:40, 92.66s/it]
  9%|▊         | 26/300 [38:15<6:20:16, 83.27s/it]
  9%|▉         | 27/300 [39:17<5:48:59, 76.70s/it]
  9%|▉         | 28/300 [41:28<7:02:31, 93.20s/it]
 10%|▉         | 29/300 [42:30<6:18:00, 83.69s/it]
 10%|█         | 30/300 [43:31<5:46:06, 76.91s/it]
 10%|█         | 31/300 [45:43<6:59:09, 93.49s/it]
 11%|█         | 32/300 [46:35<6:01:12, 80.87s/it]
 11%|█         | 33/300 [47:36<5:33:28, 74.94s/it]
 11%|█▏        | 34/300 [49:48<6:47:55, 92.01s/it]
 12%|█▏        | 35/300 [50:49<6:05:46, 82.82s/it]
 12%|█▏        | 36/300 [51:50<5:35:51, 76.33s/it]
 12%|█▏        | 37/300 [54:02<6:47:53, 93.06s/it]
 13%|█▎        | 38/300 [55:04<6:05:03, 83.60s/it]
 13%|█▎        | 39/300 [56:05<5:34:11, 76.82s/it]
 13%|█▎        | 40/300 [58:16<6:44:09, 93.27s/it]
 14%|█▎        | 41/300 [59:08<5:48:24, 80.71s/it]
 14%|█▍        | 42/300 [1:00:09<5:21:47, 74.84s/it]
 14%|█▍        | 43/300 [1:02:23<6:36:22, 92.54s/it]
 15%|█▍        | 44/300 [1:03:24<5:54:57, 83.19s/it]
 15%|█▌        | 45/300 [1:04:25<5:25:41, 76.63s/it]
 15%|█▌        | 46/300 [1:06:40<6:38:18, 94.09s/it]
 16%|█▌        | 47/300 [1:07:42<5:55:36, 84.34s/it]
 16%|█▌        | 48/300 [1:08:43<5:24:55, 77.36s/it]
 16%|█▋        | 49/300 [1:10:57<6:34:36, 94.33s/it]
 17%|█▋        | 50/300 [1:11:48<5:39:29, 81.48s/it]
 17%|█▋        | 51/300 [1:12:49<5:12:47, 75.37s/it]
 17%|█▋        | 52/300 [1:15:02<6:22:07, 92.45s/it]
 18%|█▊        | 53/300 [1:16:03<5:42:32, 83.21s/it]
 18%|█▊        | 54/300 [1:17:05<5:14:15, 76.65s/it]
 18%|█▊        | 55/300 [1:19:17<6:21:07, 93.34s/it]
 19%|█▊        | 56/300 [1:20:19<5:40:55, 83.83s/it]
 19%|█▉        | 57/300 [1:21:20<5:11:50, 77.00s/it]
 19%|█▉        | 58/300 [1:23:32<6:17:04, 93.49s/it]
 20%|█▉        | 59/300 [1:24:23<5:25:00, 80.92s/it]
 20%|██        | 60/300 [1:25:24<4:59:52, 74.97s/it]
 20%|██        | 61/300 [1:27:36<6:06:30, 92.01s/it]
 21%|██        | 62/300 [1:28:38<5:28:51, 82.91s/it]
 21%|██        | 63/300 [1:29:39<5:02:04, 76.48s/it]
 21%|██▏       | 64/300 [1:31:52<6:06:38, 93.22s/it]
 22%|██▏       | 65/300 [1:32:53<5:28:04, 83.76s/it]
 22%|██▏       | 66/300 [1:33:54<5:00:08, 76.96s/it]
 22%|██▏       | 67/300 [1:36:08<6:05:07, 94.02s/it]
 23%|██▎       | 68/300 [1:37:00<5:14:29, 81.33s/it]
 23%|██▎       | 69/300 [1:38:01<4:49:42, 75.25s/it]
 23%|██▎       | 70/300 [1:40:13<5:53:38, 92.25s/it]
 24%|██▎       | 71/300 [1:41:15<5:17:05, 83.08s/it]
 24%|██▍       | 72/300 [1:42:16<4:50:59, 76.58s/it]
 24%|██▍       | 73/300 [1:44:29<5:54:18, 93.65s/it]
 25%|██▍       | 74/300 [1:45:31<5:16:47, 84.10s/it]
 25%|██▌       | 75/300 [1:46:33<4:49:39, 77.24s/it]
 25%|██▌       | 76/300 [1:48:45<5:50:25, 93.86s/it]
 26%|██▌       | 77/300 [1:49:37<5:02:00, 81.26s/it]
 26%|██▌       | 78/300 [1:50:38<4:38:17, 75.22s/it]
 26%|██▋       | 79/300 [1:52:50<5:39:05, 92.06s/it]
 27%|██▋       | 80/300 [1:53:51<5:04:06, 82.94s/it]
 27%|██▋       | 81/300 [1:54:53<4:39:09, 76.48s/it]
 27%|██▋       | 82/300 [1:57:05<5:38:29, 93.16s/it]
 28%|██▊       | 83/300 [1:58:06<5:02:55, 83.76s/it]
 28%|██▊       | 84/300 [1:59:08<4:37:09, 76.99s/it]
 28%|██▊       | 85/300 [2:01:20<5:35:20, 93.58s/it]
 29%|██▊       | 86/300 [2:02:12<4:48:59, 81.03s/it]
 29%|██▉       | 87/300 [2:03:13<4:26:21, 75.03s/it]
 29%|██▉       | 88/300 [2:05:25<5:26:03, 92.28s/it]
 30%|██▉       | 89/300 [2:06:27<4:52:19, 83.12s/it]
 30%|███       | 90/300 [2:07:28<4:28:07, 76.60s/it]
 30%|███       | 91/300 [2:09:41<5:24:56, 93.29s/it]
 31%|███       | 92/300 [2:10:42<4:50:37, 83.83s/it]
 31%|███       | 93/300 [2:11:44<4:25:56, 77.08s/it]
 31%|███▏      | 94/300 [2:13:58<5:23:04, 94.10s/it]
 32%|███▏      | 95/300 [2:14:49<4:38:09, 81.41s/it]
 32%|███▏      | 96/300 [2:15:51<4:16:13, 75.36s/it]
 32%|███▏      | 97/300 [2:18:02<5:11:51, 92.18s/it]
 33%|███▎      | 98/300 [2:19:04<4:39:44, 83.09s/it]
 33%|███▎      | 99/300 [2:20:05<4:16:20, 76.52s/it]
 33%|███▎      | 100/300 [2:22:17<5:10:52, 93.26s/it]
 34%|███▎      | 101/300 [2:23:19<4:38:04, 83.84s/it]
 34%|███▍      | 102/300 [2:24:20<4:14:11, 77.03s/it]
 34%|███▍      | 103/300 [2:26:32<5:06:49, 93.45s/it]
 35%|███▍      | 104/300 [2:27:24<4:24:28, 80.96s/it]
 35%|███▌      | 105/300 [2:28:25<4:03:52, 75.04s/it]
 35%|███▌      | 106/300 [2:30:38<4:59:03, 92.49s/it]
 36%|███▌      | 107/300 [2:31:40<4:27:55, 83.29s/it]
 36%|███▌      | 108/300 [2:32:42<4:05:22, 76.68s/it]
 36%|███▋      | 109/300 [2:34:53<4:56:44, 93.22s/it]
 37%|███▋      | 110/300 [2:35:55<4:25:29, 83.84s/it]
 37%|███▋      | 111/300 [2:36:57<4:02:44, 77.06s/it]
 37%|███▋      | 112/300 [2:39:08<4:52:30, 93.35s/it]
 38%|███▊      | 113/300 [2:40:00<4:12:11, 80.92s/it]
 38%|███▊      | 114/300 [2:41:01<3:52:29, 75.00s/it]
 38%|███▊      | 115/300 [2:43:12<4:43:29, 91.94s/it]
 39%|███▊      | 116/300 [2:44:14<4:14:19, 82.93s/it]
 39%|███▉      | 117/300 [2:45:16<3:53:11, 76.45s/it]
 39%|███▉      | 118/300 [2:47:28<4:42:23, 93.10s/it]
 40%|███▉      | 119/300 [2:48:30<4:12:38, 83.75s/it]
 40%|████      | 120/300 [2:49:31<3:50:55, 76.98s/it]
 40%|████      | 121/300 [2:51:42<4:38:14, 93.27s/it]
 41%|████      | 122/300 [2:52:34<3:59:57, 80.88s/it]
 41%|████      | 123/300 [2:53:35<3:41:07, 74.96s/it]
 41%|████▏     | 124/300 [2:55:47<4:30:02, 92.06s/it]
 42%|████▏     | 125/300 [2:56:49<4:02:06, 83.01s/it]
 42%|████▏     | 126/300 [2:57:50<3:41:55, 76.53s/it]
 42%|████▏     | 127/300 [3:00:04<4:29:43, 93.55s/it]
 43%|████▎     | 128/300 [3:01:06<4:01:07, 84.11s/it]
 43%|████▎     | 129/300 [3:02:07<3:40:09, 77.25s/it]
 43%|████▎     | 130/300 [3:04:19<4:25:15, 93.62s/it]
 44%|████▎     | 131/300 [3:05:11<3:48:30, 81.13s/it]
 44%|████▍     | 132/300 [3:06:12<3:30:28, 75.17s/it]
 44%|████▍     | 133/300 [3:08:24<4:16:45, 92.25s/it]
 45%|████▍     | 134/300 [3:09:26<3:50:07, 83.18s/it]
 45%|████▌     | 135/300 [3:10:27<3:30:37, 76.59s/it]
 45%|████▌     | 136/300 [3:12:39<4:14:43, 93.19s/it]
 46%|████▌     | 137/300 [3:13:41<3:47:47, 83.85s/it]
 46%|████▌     | 138/300 [3:14:42<3:28:00, 77.04s/it]
 46%|████▋     | 139/300 [3:16:53<4:09:49, 93.10s/it]
 47%|████▋     | 140/300 [3:17:45<3:35:26, 80.79s/it]
 47%|████▋     | 141/300 [3:18:46<3:18:27, 74.89s/it]
 47%|████▋     | 142/300 [3:20:58<4:02:03, 91.92s/it]
 48%|████▊     | 143/300 [3:22:00<3:37:02, 82.94s/it]
 48%|████▊     | 144/300 [3:23:01<3:18:46, 76.45s/it]
 48%|████▊     | 145/300 [3:25:13<4:00:19, 93.03s/it]
 49%|████▊     | 146/300 [3:26:15<3:34:54, 83.73s/it]
 49%|████▉     | 147/300 [3:27:16<3:16:11, 76.94s/it]
 49%|████▉     | 148/300 [3:29:30<3:58:25, 94.11s/it]
 50%|████▉     | 149/300 [3:30:22<3:25:04, 81.48s/it]
 50%|█████     | 150/300 [3:31:23<3:08:27, 75.39s/it]
 50%|█████     | 151/300 [3:33:36<3:49:47, 92.53s/it]
 51%|█████     | 152/300 [3:34:38<3:25:44, 83.41s/it]
 51%|█████     | 153/300 [3:35:39<3:08:10, 76.81s/it]
 51%|█████▏    | 154/300 [3:37:52<3:47:14, 93.38s/it]
 52%|█████▏    | 155/300 [3:38:54<3:23:04, 84.03s/it]
 52%|█████▏    | 156/300 [3:39:55<3:05:12, 77.17s/it]
 52%|█████▏    | 157/300 [3:42:06<3:42:41, 93.43s/it]
 53%|█████▎    | 158/300 [3:42:58<3:11:51, 81.07s/it]
 53%|█████▎    | 159/300 [3:44:00<2:56:31, 75.12s/it]
 53%|█████▎    | 160/300 [3:46:11<3:34:33, 91.96s/it]
 54%|█████▎    | 161/300 [3:47:13<3:12:12, 82.97s/it]
 54%|█████▍    | 162/300 [3:48:14<2:55:53, 76.47s/it]
 54%|█████▍    | 163/300 [3:50:26<3:32:27, 93.05s/it]
 55%|█████▍    | 164/300 [3:51:28<3:09:53, 83.78s/it]
 55%|█████▌    | 165/300 [3:52:29<2:53:10, 76.97s/it]
 55%|█████▌    | 166/300 [3:54:42<3:29:10, 93.66s/it]
 56%|█████▌    | 167/300 [3:55:34<2:59:56, 81.18s/it]
 56%|█████▌    | 168/300 [3:56:35<2:45:23, 75.18s/it]
 56%|█████▋    | 169/300 [3:58:47<3:21:27, 92.27s/it]
 57%|█████▋    | 170/300 [3:59:49<3:00:22, 83.25s/it]
 57%|█████▋    | 171/300 [4:00:51<2:44:56, 76.71s/it]
 57%|█████▋    | 172/300 [4:03:03<3:19:21, 93.45s/it]
 58%|█████▊    | 173/300 [4:04:06<2:57:59, 84.09s/it]
 58%|█████▊    | 174/300 [4:05:07<2:42:04, 77.18s/it]
 58%|█████▊    | 175/300 [4:07:20<3:15:50, 94.01s/it]
 59%|█████▊    | 176/300 [4:08:12<2:48:18, 81.44s/it]
 59%|█████▉    | 177/300 [4:09:13<2:34:24, 75.32s/it]
 59%|█████▉    | 178/300 [4:11:24<3:07:07, 92.03s/it]
 60%|█████▉    | 179/300 [4:12:26<2:47:36, 83.11s/it]
 60%|██████    | 180/300 [4:13:28<2:33:03, 76.53s/it]
 60%|██████    | 181/300 [4:15:40<3:04:53, 93.22s/it]
 61%|██████    | 182/300 [4:16:42<2:45:04, 83.93s/it]
 61%|██████    | 183/300 [4:17:43<2:30:16, 77.06s/it]
 61%|██████▏   | 184/300 [4:19:56<3:01:18, 93.78s/it]
 62%|██████▏   | 185/300 [4:20:48<2:35:51, 81.32s/it]
 62%|██████▏   | 186/300 [4:21:49<2:22:58, 75.25s/it]
 62%|██████▏   | 187/300 [4:24:00<2:53:16, 92.01s/it]
 63%|██████▎   | 188/300 [4:25:03<2:35:05, 83.08s/it]
 63%|██████▎   | 189/300 [4:26:04<2:21:38, 76.57s/it]
 63%|██████▎   | 190/300 [4:28:16<2:51:10, 93.37s/it]
 64%|██████▎   | 191/300 [4:29:19<2:32:41, 84.05s/it]
 64%|██████▍   | 192/300 [4:30:20<2:18:55, 77.18s/it]
 64%|██████▍   | 193/300 [4:32:34<2:47:52, 94.14s/it]
 65%|██████▍   | 194/300 [4:33:26<2:24:06, 81.57s/it]
 65%|██████▌   | 195/300 [4:34:27<2:12:04, 75.48s/it]
 65%|██████▌   | 196/300 [4:36:38<2:39:45, 92.17s/it]
 66%|██████▌   | 197/300 [4:37:41<2:22:51, 83.21s/it]
 66%|██████▌   | 198/300 [4:38:42<2:10:24, 76.71s/it]
 66%|██████▋   | 199/300 [4:40:55<2:37:16, 93.43s/it]
 67%|██████▋   | 200/300 [4:41:57<2:20:12, 84.12s/it]
 67%|██████▋   | 201/300 [4:42:58<2:07:24, 77.22s/it]
 67%|██████▋   | 202/300 [4:45:09<2:32:28, 93.36s/it]
 68%|██████▊   | 203/300 [4:46:02<2:11:07, 81.11s/it]
 68%|██████▊   | 204/300 [4:47:03<2:00:12, 75.13s/it]
 68%|██████▊   | 205/300 [4:49:14<2:25:21, 91.81s/it]
 69%|██████▊   | 206/300 [4:50:16<2:09:59, 82.98s/it]
 69%|██████▉   | 207/300 [4:51:17<1:58:31, 76.47s/it]
 69%|██████▉   | 208/300 [4:53:31<2:23:32, 93.62s/it]
 70%|██████▉   | 209/300 [4:54:33<2:07:50, 84.29s/it]
 70%|███████   | 210/300 [4:55:34<1:56:00, 77.34s/it]
 70%|███████   | 211/300 [4:57:46<2:18:45, 93.55s/it]
 71%|███████   | 212/300 [4:58:38<1:59:00, 81.15s/it]
 71%|███████   | 213/300 [4:59:39<1:48:51, 75.07s/it]
 71%|███████▏  | 214/300 [5:01:50<2:11:46, 91.94s/it]
 72%|███████▏  | 215/300 [5:02:53<1:57:42, 83.09s/it]
 72%|███████▏  | 216/300 [5:03:54<1:47:11, 76.57s/it]
 72%|███████▏  | 217/300 [5:06:05<2:08:33, 92.93s/it]
 73%|███████▎  | 218/300 [5:07:08<1:54:33, 83.82s/it]
 73%|███████▎  | 219/300 [5:08:09<1:43:56, 76.99s/it]
 73%|███████▎  | 220/300 [5:10:22<2:05:05, 93.81s/it]
 74%|███████▎  | 221/300 [5:11:14<1:47:09, 81.39s/it]
 74%|███████▍  | 222/300 [5:12:15<1:37:52, 75.29s/it]
 74%|███████▍  | 223/300 [5:14:26<1:58:06, 92.03s/it]
 75%|███████▍  | 224/300 [5:15:29<1:45:18, 83.14s/it]
 75%|███████▌  | 225/300 [5:16:30<1:35:44, 76.59s/it]
 75%|███████▌  | 226/300 [5:18:41<1:54:26, 92.79s/it]
 76%|███████▌  | 227/300 [5:19:43<1:41:49, 83.70s/it]
 76%|███████▌  | 228/300 [5:20:44<1:32:17, 76.91s/it]
 76%|███████▋  | 229/300 [5:22:56<1:50:22, 93.28s/it]
 77%|███████▋  | 230/300 [5:23:48<1:34:32, 81.03s/it]
 77%|███████▋  | 231/300 [5:24:49<1:26:20, 75.08s/it]
 77%|███████▋  | 232/300 [5:27:00<1:44:08, 91.89s/it]
 78%|███████▊  | 233/300 [5:28:03<1:32:46, 83.08s/it]
 78%|███████▊  | 234/300 [5:29:04<1:24:12, 76.55s/it]
 78%|███████▊  | 235/300 [5:31:15<1:40:35, 92.86s/it]
 79%|███████▊  | 236/300 [5:32:18<1:29:24, 83.81s/it]
 79%|███████▉  | 237/300 [5:33:19<1:20:51, 77.01s/it]
 79%|███████▉  | 238/300 [5:35:30<1:36:19, 93.21s/it]
 80%|███████▉  | 239/300 [5:36:23<1:22:22, 81.02s/it]
 80%|████████  | 240/300 [5:37:24<1:15:02, 75.04s/it]
 80%|████████  | 241/300 [5:39:37<1:31:01, 92.57s/it]
 81%|████████  | 242/300 [5:40:40<1:20:47, 83.57s/it]
 81%|████████  | 243/300 [5:41:41<1:13:03, 76.91s/it]
 81%|████████▏ | 244/300 [5:43:52<1:26:46, 92.97s/it]
 82%|████████▏ | 245/300 [5:44:54<1:16:52, 83.87s/it]
 82%|████████▏ | 246/300 [5:45:55<1:09:19, 77.02s/it]
 82%|████████▏ | 247/300 [5:48:06<1:22:16, 93.13s/it]
 83%|████████▎ | 248/300 [5:48:59<1:10:10, 80.97s/it]
 83%|████████▎ | 249/300 [5:50:00<1:03:46, 75.02s/it]
 83%|████████▎ | 250/300 [5:52:13<1:17:01, 92.43s/it]
 84%|████████▎ | 251/300 [5:53:16<1:08:14, 83.57s/it]
 84%|████████▍ | 252/300 [5:54:17<1:01:32, 76.92s/it]
 84%|████████▍ | 253/300 [5:56:29<1:13:04, 93.29s/it]
 85%|████████▍ | 254/300 [5:57:31<1:04:29, 84.12s/it]
 85%|████████▌ | 255/300 [5:58:32<57:55, 77.23s/it]  
 85%|████████▌ | 256/300 [6:00:44<1:08:38, 93.60s/it]
 86%|████████▌ | 257/300 [6:01:37<58:18, 81.35s/it]  
 86%|████████▌ | 258/300 [6:02:38<52:41, 75.28s/it]
 86%|████████▋ | 259/300 [6:04:51<1:03:18, 92.65s/it]
 87%|████████▋ | 260/300 [6:05:54<55:47, 83.68s/it]  
 87%|████████▋ | 261/300 [6:06:55<50:02, 76.98s/it]
 87%|████████▋ | 262/300 [6:09:06<58:59, 93.14s/it]
 88%|████████▊ | 263/300 [6:10:09<51:47, 83.99s/it]
 88%|████████▊ | 264/300 [6:11:10<46:16, 77.13s/it]
 88%|████████▊ | 265/300 [6:13:21<54:21, 93.18s/it]
 89%|████████▊ | 266/300 [6:14:13<45:54, 81.02s/it]
 89%|████████▉ | 267/300 [6:15:14<41:16, 75.04s/it]
 89%|████████▉ | 268/300 [6:17:25<48:51, 91.60s/it]
 90%|████████▉ | 269/300 [6:18:27<42:52, 82.98s/it]
 90%|█████████ | 270/300 [6:19:29<38:15, 76.52s/it]
 90%|█████████ | 271/300 [6:21:40<44:54, 92.92s/it]
 91%|█████████ | 272/300 [6:22:43<39:09, 83.89s/it]
 91%|█████████ | 273/300 [6:23:44<34:39, 77.02s/it]
 91%|█████████▏| 274/300 [6:25:55<40:24, 93.23s/it]
 92%|█████████▏| 275/300 [6:26:48<33:47, 81.10s/it]
 92%|█████████▏| 276/300 [6:27:49<30:03, 75.14s/it]
 92%|█████████▏| 277/300 [6:30:01<35:23, 92.32s/it]
 93%|█████████▎| 278/300 [6:31:04<30:36, 83.48s/it]
 93%|█████████▎| 279/300 [6:32:06<26:53, 76.84s/it]
 93%|█████████▎| 280/300 [6:34:16<31:00, 93.03s/it]
 94%|█████████▎| 281/300 [6:35:19<26:35, 83.96s/it]
 94%|█████████▍| 282/300 [6:36:20<23:08, 77.14s/it]
 94%|█████████▍| 283/300 [6:38:31<26:22, 93.06s/it]
 95%|█████████▍| 284/300 [6:39:23<21:35, 80.97s/it]
 95%|█████████▌| 285/300 [6:40:25<18:45, 75.04s/it]
 95%|█████████▌| 286/300 [6:42:37<21:30, 92.19s/it]
 96%|█████████▌| 287/300 [6:43:40<18:03, 83.36s/it]
 96%|█████████▌| 288/300 [6:44:41<15:21, 76.77s/it]
 96%|█████████▋| 289/300 [6:46:53<17:05, 93.22s/it]
 97%|█████████▋| 290/300 [6:47:55<14:01, 84.14s/it]
 97%|█████████▋| 291/300 [6:48:56<11:34, 77.19s/it]
 97%|█████████▋| 292/300 [6:51:07<12:25, 93.22s/it]
 98%|█████████▊| 293/300 [6:52:00<09:27, 81.12s/it]
 98%|█████████▊| 294/300 [6:52:51<07:13, 72.20s/it]
 98%|█████████▊| 295/300 [6:54:47<07:06, 85.33s/it]
 99%|█████████▊| 296/300 [6:55:31<04:50, 72.74s/it]
 99%|█████████▉| 297/300 [6:56:07<03:05, 61.95s/it]
 99%|█████████▉| 298/300 [6:57:41<02:23, 71.58s/it]
100%|█████████▉| 299/300 [6:57:43<00:50, 50.51s/it]
100%|██████████| 300/300 [6:57:43<00:00, 35.40s/it]
100%|██████████| 300/300 [6:57:43<00:00, 83.54s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     300       
Failed requests:                         0         
Maximum request concurrency:             64        
Benchmark duration (s):                  25063.49  
Total input tokens:                      21000000  
Total generated tokens:                  450000    
Request throughput (req/s):              0.01      
Output token throughput (tok/s):         17.95     
Peak output token throughput (tok/s):    69.00     
Peak concurrent requests:                65.00     
Total token throughput (tok/s):          855.83    
---------------Time to First Token----------------
Mean TTFT (ms):                          4639166.81
Median TTFT (ms):                        5158200.08
P95 TTFT (ms):                           5229279.25
P99 TTFT (ms):                           5233297.08
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          129.52    
Median TPOT (ms):                        130.23    
P95 TPOT (ms):                           133.87    
P99 TPOT (ms):                           134.47    
---------------Inter-token Latency----------------
Mean ITL (ms):                           129.52    
Median ITL (ms):                         48.44     
P95 ITL (ms):                            55.38     
P99 ITL (ms):                            89.13     
==================================================
Warning: Resource leak detected by SharedSignalPool, 32 Signals leaked.